# Для отображения информации о папке в GitBash используется команда ls

# Для отображения информации о папке в терминале используется команда dir

# Чтобы перейти в папку, необходимо написать команду cd и название папки
# Чтобы перейти в предыдущую папку, необходимо написать команду cd ..

# Чтобы превратить папку в репозиторий Git - необходимо прописать команду git init , либо в среде разработки в разделе ГИТ


# Для добавления файлов в коммит используется команда git add (Название файла)
# Если вместо названия файлов поставить . будут добавлены все файлы

# После этого нужно выполнить команду git commit -m и указать название нашего комита
# После этого команда git remote add origin https://github.com/MrProdeon/4.git которая придает слову origin нашу ссылку
# После этого команда git push -u origin main которая по ссылке origin отправляет нашу ветку main


# В редакторе кода необходимо нажать на инициализацию репозитория
# Далее в message пишем наш комментарий и нажимаем commit
# После этого publish branch

# Чтобы клонировать репозиторий - можно просто скачать его на ГитХабе
# Либо можно в ГитБаше ввести команду git clone и ввести ссылку на репозиторий из Code